## Pandas DataFrame

판다스에서 데이터(테이블 형태 - DB, 엑셀, CSV, JSON) 처리하는 가장 기본단위 자료구조

<img src="https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Ft1.daumcdn.net%2Fcfile%2Ftistory%2F99FD8D385BFBECE32D" width=500>

데이터프레임 생성
```
pd.DataFrame(...)
```

In [2]:
import pandas as pd

In [3]:
# 데이터프레임 생성
data = {
    '이름': ['홍길동', '홍길순', '성유고', '박애슐'],
    '국어': [80, 100, 10, 90],
    '영어': [50, 100, 99, 100],
    '수학': [90, 100, 10, 40],
    '미술': [100, 100, 99, 30]
}  # 기본데이터 실제로는 excel, db, csv, openAPI 등 다른곳에서 받아와서 처리

df1 = pd.DataFrame(data=data)
df1

    이름   국어   영어   수학   미술
0  홍길동   80   50   90  100
1  홍길순  100  100  100  100
2  성유고   10   99   10   99
3  박애슐   90  100   40   30

### 데이터프레임 핸들링

#### 특정컬럼 사용, 데이터프레임 생성

In [4]:
data

{'이름': ['홍길동', '홍길순', '성유고', '박애슐'],
 '국어': [80, 100, 10, 90],
 '영어': [50, 100, 99, 100],
 '수학': [90, 100, 10, 40],
 '미술': [100, 100, 99, 30]}

In [6]:
df2 = pd.DataFrame(data=data, columns=['이름', '영어'])
df2

    이름   영어
0  홍길동   50
1  홍길순  100
2  성유고   99
3  박애슐  100

In [8]:
df3 = pd.DataFrame(data=data, columns=['이름','미술','음악'])
df3

    이름   미술   음악
0  홍길동  100  NaN
1  홍길순  100  NaN
2  성유고   99  NaN
3  박애슐   30  NaN

In [10]:
# 인덱스번호를 변경해서 DF 생성
df4 = pd.DataFrame(data=data, index=[x for x in range(1, len(data))])
df4

    이름   국어   영어   수학   미술
1  홍길동   80   50   90  100
2  홍길순  100  100  100  100
3  성유고   10   99   10   99
4  박애슐   90  100   40   30

In [11]:
pd.DataFrame(data=data, index=['첫번째','두번째','세번째','네번째'])

      이름   국어   영어   수학   미술
첫번째  홍길동   80   50   90  100
두번째  홍길순  100  100  100  100
세번째  성유고   10   99   10   99
네번째  박애슐   90  100   40   30

### DF 내의 데이터 조회

In [16]:
df1['국어']

0     80
1    100
2     10
3     90
Name: 국어, dtype: int64

In [14]:
type(df1['국어'])

pandas.core.series.Series

In [17]:
df1[['이름','수학']]

    이름   수학
0  홍길동   90
1  홍길순  100
2  성유고   10
3  박애슐   40

In [18]:
type(df1[['이름','수학']])

pandas.core.frame.DataFrame